---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateGUID
source: html/714955e8-e780-f541-4894-1a181bd9d1ea.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateGUID Method

Creates a randomized GUID.

## Syntax (C#)
```csharp
public static string CreateGUID()
```

## Returns
The guid string.